"""
Завдання: оголосіть клас Point3D для точок з трьома координатами x, y, z.
Створіть декілька екземплярів цього класу і через них виведіть у консоль
значення x, y, z. Потім виконайте наступні маніпуляції:
    1) змініть будь-яке значення координати в класі Point3D і подивіться
    як це вплине на відображені велечини екземплярів класу;
    2) удаліть координату z в класі Point3D і переконайтесь, що вона
    буде відсутня в усіх екземплярах;
    3) змініть координату в якомусь екземплярі класу і подивіться на результат.
"""
print("Ініціалізація класу та його об'єктів")
class Point3D:
    x = 1
    y = 2
    z = 3

ex_1 = Point3D()
print(ex_1.x)

ex_2 = Point3D()
print(ex_2.y)

ex_3 = Point3D()
print(ex_3.z)

# 1 Завдання
print("\n Завдання 1: ")
#Point3D.x = -7 інший спосіб присвоєння значення атрибута
setattr(Point3D, 'x', -7)
print(ex_1.x, ex_2.x, ex_3.x, Point3D.x)

"""
Висновок: змінились усі атрибути "х" екземплярів класу Point3D. Причина -
ці атрибути в екземплярах були лише посиланнями на атрибути класу.
Це можна перевірити за допомогою виписування локальних змінних екзеплярів.
"""
#print(ex_1.__dict__, ex_2.__dict__, ex_3.__dict__)

# 2 Завдання
print('\n Завдання 2: ')

delattr(Point3D, 'z')
print(hasattr(ex_1, 'z'), hasattr(ex_2, 'z'),
      hasattr(ex_3, 'z'), hasattr(Point3D, 'z'))

"""
Висновок: видалення атрибуту класу веде до видалення посилання на цей атрибут
у кожного екземпляра класу. Але якщо існувала локальна змінна до видалення
з таким самим ім'ям, то вона так і продовжить існувати в екземплярі класу
після видалення атрибуту з самого класу (див. 3 Завдання)
"""

# 3 Завдання
print("\n Завдання 3: ")

Point3D.z = 3
ex_1.z = "-7"
del Point3D.z
print(hasattr(ex_1, 'z'), hasattr(Point3D, 'z'), '\n', ex_1.__dict__)

"""
Висновок: у екземплярі класу ex_1 ми записали змінну z, як локальну змінну.
Після цього запису видалились зв'язки з атрибутом z класу Point3D.
"""
